import Banner from "../components/Banner";
import { TimelineItem } from "./TimelineItem";
import { TimeLineItemModel } from "./TimelineItemModel";

export default async function RootRoute({
  params,
}: {
  params: { lang: string };
}) {
  return (
    <>
      {/* <Banner>
        <div className="flex flex-col  items-center text-center  text-white py-20">
          <div className="flex max-w-screen-2xl flex-row mx-auto justify-center">
            <h1 className="font-extrabold text-4xl">تاریخچه</h1>
          </div>
        </div>
      </Banner>

      <div className="max-w-full flex flex-row justify-center mt-10 mb-10">
        <div className="-my-6 w-8/12">
          <TimelineItem
            time="فروردین 1372"
            subtitle="شرکت کاراگستر در تهران تاسیس شد"
            description="شرکت مهندسی کاراگستر در سال ۱۳۷۲ تاسیس گردیده و در زمینه طراحی و ساخت انواع قطعات ماشین‌آلات و قالب‌های صنعتی و تجهیزات جانبی صنایع از جمله قالب‌های پخت تایر و سایر محصولات لاستیکی- ارائه خدمات فنی و مهندسی و اخذ موافقت اصولی و مجوزهای قانونی جهت احداث و راه‌اندازی کارخانجات ساخت قطعات و ماشین‌آلات و قالب‌های صنعتی- واردات و صادرات قطعات یدکی و ماشین‌آلات و قالب‌های صنعتی و اخذ نمایندگی داخلی و خارجی و انجام کلیه امور مرتبط به فعالیت های فوق الذکر فعالیت می نماید."
            title="تاسیس شرکت"
          ></TimelineItem>

          <TimelineItem
            time="فروردین 1372"
            subtitle="شرکت کاراگستر در تهران تاسیس شد"
            description="شرکت مهندسی کاراگستر در سال ۱۳۷۲ تاسیس گردیده و در زمینه طراحی و ساخت انواع قطعات ماشین‌آلات و قالب‌های صنعتی و تجهیزات جانبی صنایع از جمله قالب‌های پخت تایر و سایر محصولات لاستیکی- ارائه خدمات فنی و مهندسی و اخذ موافقت اصولی و مجوزهای قانونی جهت احداث و راه‌اندازی کارخانجات ساخت قطعات و ماشین‌آلات و قالب‌های صنعتی- واردات و صادرات قطعات یدکی و ماشین‌آلات و قالب‌های صنعتی و اخذ نمایندگی داخلی و خارجی و انجام کلیه امور مرتبط به فعالیت های فوق الذکر فعالیت می نماید."
            title="تاسیس شرکت"
          ></TimelineItem>

          <TimelineItem
            time="فروردین 1372"
            subtitle="شرکت کاراگستر در تهران تاسیس شد"
            description="شرکت مهندسی کاراگستر در سال ۱۳۷۲ تاسیس گردیده و در زمینه طراحی و ساخت انواع قطعات ماشین‌آلات و قالب‌های صنعتی و تجهیزات جانبی صنایع از جمله قالب‌های پخت تایر و سایر محصولات لاستیکی- ارائه خدمات فنی و مهندسی و اخذ موافقت اصولی و مجوزهای قانونی جهت احداث و راه‌اندازی کارخانجات ساخت قطعات و ماشین‌آلات و قالب‌های صنعتی- واردات و صادرات قطعات یدکی و ماشین‌آلات و قالب‌های صنعتی و اخذ نمایندگی داخلی و خارجی و انجام کلیه امور مرتبط به فعالیت های فوق الذکر فعالیت می نماید."
            title="تاسیس شرکت"
          ></TimelineItem>

          <TimelineItem
            time="فروردین 1372"
            subtitle="شرکت کاراگستر در تهران تاسیس شد"
            description="شرکت مهندسی کاراگستر در سال ۱۳۷۲ تاسیس گردیده و در زمینه طراحی و ساخت انواع قطعات ماشین‌آلات و قالب‌های صنعتی و تجهیزات جانبی صنایع از جمله قالب‌های پخت تایر و سایر محصولات لاستیکی- ارائه خدمات فنی و مهندسی و اخذ موافقت اصولی و مجوزهای قانونی جهت احداث و راه‌اندازی کارخانجات ساخت قطعات و ماشین‌آلات و قالب‌های صنعتی- واردات و صادرات قطعات یدکی و ماشین‌آلات و قالب‌های صنعتی و اخذ نمایندگی داخلی و خارجی و انجام کلیه امور مرتبط به فعالیت های فوق الذکر فعالیت می نماید."
            title="تاسیس شرکت"
          ></TimelineItem>

          <TimelineItem
            time="فروردین 1372"
            subtitle="شرکت کاراگستر در تهران تاسیس شد"
            description="شرکت مهندسی کاراگستر در سال ۱۳۷۲ تاسیس گردیده و در زمینه طراحی و ساخت انواع قطعات ماشین‌آلات و قالب‌های صنعتی و تجهیزات جانبی صنایع از جمله قالب‌های پخت تایر و سایر محصولات لاستیکی- ارائه خدمات فنی و مهندسی و اخذ موافقت اصولی و مجوزهای قانونی جهت احداث و راه‌اندازی کارخانجات ساخت قطعات و ماشین‌آلات و قالب‌های صنعتی- واردات و صادرات قطعات یدکی و ماشین‌آلات و قالب‌های صنعتی و اخذ نمایندگی داخلی و خارجی و انجام کلیه امور مرتبط به فعالیت های فوق الذکر فعالیت می نماید."
            title="تاسیس شرکت"
          ></TimelineItem>
        </div>
      </div> */}
    </>
  );
}
